#include <stdio.h>

int main()
{
   
    int d,m,y;
    printf("Введите день, месяц и год рождения.\n");
    printf("День:");
    scanf("%i", &d);
    printf("Месяц:");
    scanf("%i", &m);
    printf("Год:");
    scanf("%i", &y);

    if (y%4==0)
    {
        printf("1. Год рождения високосный.\n");
    }
    else
    {
        printf("1. Год рождения не високосный.\n");
    }
    
    switch (y%12)
    {
    case 0:
        printf("2. Год по восточному календарю - Обезьяна.\n");
        break;
    case 1:
        printf("2. Год по восточному календарю - Петух.\n");
        break;           
    case 2:
        printf("2. Год по восточному календарю - Собака.\n");
        break;
    case 3:
        printf("2. Год по восточному календарю - Свинья.\n");
        break;
    case 4:
        printf("2. Год по восточному календарю - Крыса.\n");
        break;
    case 5:
        printf("2. Год по восточному календарю - Бык.\n");
        break;
    case 6:
        printf("2. Год по восточному календарю - Тигр.\n");
        break;
    case 7:
        printf("2. Год по восточному календарю - Кролик.\n");
        break;
    case 8:
        printf("2. Год по восточному календарю - Дракон.\n");
        break;
    case 9:
        printf("2. Год по восточному календарю - Змея.\n");
        break;
    case 10:
        printf("2. Год по восточному календарю - Лошадь.\n");
        break;
    case 11:
        printf("2. Год по восточному календарю - Коза.\n");
        break;
    default:
        break;
    }
    

    if ((m==12&&d>19)||(m==1&&d<22))
    {
        printf("Знак задиака - Козерог.\n");
    }
    if ((m==1&&d>19)||(m==2&&d<22))
    {
        printf("Знак задиака - Водолей.\n");
    }
    if ((m==2&&d>19)||(m==3&&d<22))
    {
        printf("Знак задиака - Рыбы.\n");
    }
    if ((m==3&&d>19)||(m==4&&d<22))
    {
        printf("Знак задиака - Овен.\n");
    }
    if ((m==4&&d>19)||(m==5&&d<22))
    {
        printf("Знак задиака - Телец.\n");
    }
    if ((m==5&&d>19)||(m==6&&d<22))
    {
        printf("Знак задиака - Близнецы.\n");
    }
    if ((m==6&&d>19)||(m==7&&d<22))
    {
        printf("Знак задиака - Рак.\n");
    }
    if ((m==7&&d>19)||(m==8&&d<22))
    {
        printf("Знак задиака - Лев.\n");
    }
    if ((m==8&&d>19)||(m==0&&d<22))
    {
        printf("Знак задиака - Дева.\n");
    }
    if ((m==9&&d>19)||(m==10&&d<22))
    {
        printf("Знак задиака - Весы.\n");
    }
    if ((m==10&&d>19)||(m==11&&d<22))
    {
        printf("Знак задиака - Скорпион.\n");
    }
    if ((m==11&&d>19)||(m==12&&d<22))
    {
        printf("Знак задиака - Стрелец.\n");
    }
    
}
